v2206/atmospheric_Microclimate/01_test_ABL/Allrun
#!/bin/sh
cd "${0%/*}" || exit                                # Run from this directory
. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions        # Tutorial run functions
#------------------------------------------------------------------------------

restore0Dir

runApplication blockMesh

# runApplication setFields

runApplication $(getApplication)

touch foam.foam

#------------------------------------------------------------------------------
