v2206/atmospheric_Microclimate/01_test_ABL/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     buoyantBoussinesqPimpleFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         1000;

deltaT          0.05;

writeControl    adjustable;

writeInterval   20;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

adjustTimeStep  yes;

maxCo           0.5;

functions 
{
    yPlus
    {
        // Mandatory entries (unmodifiable)
        type            yPlus;
        libs            (fieldFunctionObjects);

        // Optional (inherited) entries
        writePrecision  10;
        writeToFile     true;
        useUserTime     true;

        region          region0;
        enabled         true;
        log             true;
        timeStart       0;
        timeEnd         100;
        executeControl  timeStep;
        executeInterval 1;
        writeControl    writeTime;
        writeInterval   1;
    }

    // fieldAverage
    // {
    //     type                fieldAverage;
    //     libs                ("fieldFunctionObjects.so");
    //     fields
    //     (
    //         U
    //         {
    //             mean        on;
    //             prime2Mean  on;
    //             base        time;
    //         }
    //         p_rgh
    //         {
    //             mean        on;
    //             prime2Mean  off;
    //             base        time;
    //         }
    //         nut
    //         {
    //             mean        on;
    //             prime2Mean  off;
    //             base        time;
    //         }
    //         T
    //         {
    //             mean        on;
    //             prime2Mean  off;
    //             base        time;
    //         }
    //     );
    //     writeControl    	runTime;
    //     writeInterval       2e4;
    //     timeStart       	2e4;
    // }
}


// ************************************************************************* //
